{"class_name": "Tokenizer", "config": {"num_words": 10000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 202658, "word_counts": "{\"widetilde\": 977, \"gamma\": 9998, \"mathrm\": 9063, \"h\": 27497, \"o\": 49084, \"p\": 28630, \"f\": 26927, \"simeq\": 423, \"sum\": 5471, \"n\": 47768, \"0\": 28869, \"g\": 27010, \"frac\": 42487, \"a\": 46731, \"2\": 77389, \"1\": 57465, \"cal\": 9267, \"l\": 28288, \"i\": 49455, \"j\": 26771, \"k\": 29569, \"s\": 31283, \"t\": 31047, \"pi\": 10852, \"sqrt\": 5477, \"5\": 3326, \"3\": 12322, \"left\": 244150, \"bar\": 7402, \"right\": 172368, \"hat\": 6338, \"sp\": 131, \"dagger\": 1680, \"d\": 38751, \"kappa\": 2567, \"phi\": 13858, \"b\": 26789, \"partial\": 15021, \"mu\": 22060, \"nu\": 10871, \"e\": 31260, \"x\": 38766, \"rho\": 5730, \"q\": 21214, \"m\": 31895, \"alpha\": 14219, \"theta\": 6909, \"w\": 15083, \"bigtriangleup\": 28, \"v\": 18616, \"c\": 70228, \"8\": 2242, \"psi\": 8515, \"operatorname\": 7076, \"textstyle\": 203, \"int\": 6526, \"y\": 16972, \"prime\": 10124, \"langle\": 2149, \"z\": 21865, \"rangle\": 3486, \"times\": 801, \"4\": 74856, \"u\": 18209, \"xi\": 4355, \"r\": 31415, \"dot\": 3309, \"pm\": 3454, \"eta\": 4325, \"beta\": 8008, \"delta\": 11660, \"tilde\": 5621, \"ell\": 1205, \"varepsilon\": 1637, \"overline\": 1988, \"begin\": 2348, \"array\": 4696, \"infty\": 3177, \"vspace\": 19, \"end\": 2348, \"equiv\": 2638, \"scriptstyle\": 41, \"qquad\": 2065, \"forall\": 167, \"in\": 957, \"epsilon\": 4913, \"zeta\": 1621, \"bf\": 4366, \"lambda\": 11897, \"omega\": 7747, \"quad\": 3515, \"9\": 867, \"tau\": 5121, \"vec\": 3930, \"sim\": 1348, \"mathop\": 23, \"prod\": 843, \"small\": 67, \"sigma\": 7983, \"ddot\": 298, \"nabla\": 1710, \"6\": 2702, \"boldmath\": 272, \"rightarrow\": 2148, \"it\": 115, \"hspace\": 822, \"stackrel\": 599, \"leftrightarrow\": 162, \"approx\": 692, \"7\": 949, \"varphi\": 3041, \"wedge\": 1076, \"underline\": 758, \"big\": 993, \"star\": 545, \"cdot\": 2174, \"widehat\": 604, \"smallskip\": 6, \"mathcal\": 1634, \"slash\": 53, \"chi\": 2695, \"cdots\": 1136, \"ldots\": 1018, \"longleftrightarrow\": 59, \"'\": 342, \"hbar\": 1015, \"dag\": 323, \"mapsto\": 130, \"mid\": 729, \"mathbf\": 790, \"otimes\": 1062, \"footnotesize\": 22, \"neq\": 316, \"ast\": 699, \"nonumber\": 178, \"binom\": 57, \"phantom\": 76, \"to\": 956, \"leq\": 582, \"mp\": 381, \"vert\": 924, \"longrightarrow\": 367, \"bigl\": 465, \"bigr\": 477, \"le\": 166, \"propto\": 228, \"scriptsize\": 97, \"dots\": 487, \"imath\": 137, \"jmath\": 86, \"geq\": 415, \"vartheta\": 386, \"textrm\": 100, \"circ\": 386, \"bigg\": 323, \"overleftarrow\": 25, \"perp\": 483, \"parallel\": 143, \"upsilon\": 104, \"biggl\": 292, \"biggr\": 288, \"ge\": 182, \"triangle\": 138, \"rightharpoonup\": 19, \"cong\": 90, \"hline\": 30, \"lbrack\": 148, \"rbrack\": 55, \"rightleftharpoons\": 3, \"oint\": 318, \"varsigma\": 40, \"im\": 54, \"ll\": 110, \"oplus\": 257, \"mathbin\": 2, \"scriptscriptstyle\": 146, \"mathit\": 24, \"supset\": 55, \"cap\": 57, \"overrightarrow\": 102, \"backslash\": 18, \"acute\": 44, \"vphantom\": 21, \"textup\": 11, \"subset\": 137, \"sf\": 99, \"lceil\": 4, \"rfloor\": 13, \"varrho\": 158, \"bigoplus\": 76, \"gg\": 95, \"check\": 183, \"lbrace\": 37, \"rbrace\": 36, \"subseteq\": 17, \"do\": 2, \"bullet\": 90, \"em\": 2, \"atop\": 47, \"ne\": 71, \"mathsf\": 39, \"not\": 223, \"tt\": 26, \"large\": 46, \"pmod\": 4, \"displaystyle\": 301, \"breve\": 83, \"raisebox\": 28, \"label\": 20, \"cup\": 54, \"raise\": 22, \"ni\": 26, \"wp\": 65, \"kern\": 66, \"llap\": 20, \"relax\": 5, \"mit\": 53, \"iota\": 109, \"tiny\": 90, \"colon\": 12, \"bigotimes\": 27, \"odot\": 22, \"textbf\": 17, \"textit\": 5, \"vdash\": 3, \"flat\": 9, \"re\": 46, \"underbrace\": 26, \"sharp\": 25, \"protect\": 44, \"grave\": 3, \"downarrow\": 50, \"setlength\": 9, \"unitlength\": 10, \"thicklines\": 6, \"put\": 33, \"circle\": 15, \"sl\": 25, \"varpi\": 72, \"bot\": 119, \"uparrow\": 53, \"lefteqn\": 5, \"vee\": 58, \"doteq\": 25, \"ref\": 21, \"sb\": 44, \"setminus\": 5, \"longmapsto\": 17, \"cdotp\": 26, \"enspace\": 20, \"thinspace\": 13, \"leftarrow\": 30, \"ule\": 13, \"14\": 4, \"mm\": 15, \"succeq\": 2, \"diamond\": 13, \"space\": 11, \"aleph\": 13, \"buildrel\": 21, \"object\": 36, \"makebox\": 30, \"bmod\": 14, \"bigcup\": 20, \"lfloor\": 8, \"overbrace\": 11, \"bigsqcup\": 2, \"fbox\": 8, \"mkern\": 5, \"emptyset\": 18, \"brack\": 1, \"line\": 11, \"framebox\": 5, \"bigcap\": 12, \"protecte\": 2, \"normalsize\": 7, \"protectu\": 3, \"asymp\": 2, \"lower\": 7, \"hrule\": 8, \"vrule\": 10, \"supseteq\": 5, \"huge\": 2, \"hookrightarrow\": 10, \"bigwedge\": 11, \"pt\": 17, \"exists\": 3, \"natural\": 8, \"bigvee\": 1, \"bigtriangledown\": 4, \"smash\": 2, \"biggm\": 2, \"oslash\": 2, \"land\": 10, \"surd\": 5, \"strut\": 3, \"setcounter\": 2, \"smile\": 2, \"verb\": 1, \"unboldmath\": 5, \"nolinebreak\": 1, \"sc\": 119, \"prec\": 4, \"protectz\": 1, \"rightarrowfill\": 2, \"vcenter\": 3, \"diamondsuit\": 8, \"parbox\": 2, \"ominus\": 13, \"10\": 347, \"pounds\": 13, \"multiput\": 4, \"ss\": 10, \"bigm\": 5, \"top\": 3, \"rlap\": 11, \"sqcup\": 4, \"longleftarrow\": 1, \"noalign\": 5, \"vskip\": 2, \"notin\": 2, \"fboxsep\": 2, \"triangleright\": 4, \"ooalign\": 1, \"hfil\": 2, \"crcr\": 1, \"hfill\": 10, \"succ\": 1, \"renewcommand\": 2, \"arraystretch\": 2, \"arraycolsep\": 2, \"vline\": 1, \"mathversion\": 2, \"protectm\": 1, \"hphantom\": 1, \"ddag\": 2, \"cite\": 3, \"medskip\": 1, \"triangleleft\": 1, \"null\": 2, \"ensuremath\": 4, \"root\": 1, \"of\": 1, \"ddagger\": 5, \"enskip\": 13, \"texttt\": 1, \"arrowvert\": 2, \"overwithdelims\": 1, \"aa\": 3, \"skew\": 2, \"mathrel\": 1, \"sqcap\": 4, \"amalg\": 4, \"textsf\": 1, \"leavevmode\": 1, \"cm\": 6, \"mathstrut\": 1, \"symbol\": 2, \"footnotemark\": 1, \"mathopen\": 1, \"mathclose\": 1, \"smallint\": 2, \"atopwithdelims\": 2, \"special\": 1, \"vss\": 3, \"hss\": 2, \"lgroup\": 1, \"rgroup\": 1, \"html\": 180000, \"head\": 180000, \"body\": 180000, \"style\": 578562, \"margin\": 282367, \"2px\": 282367, \"div\": 564734, \"overflow\": 282367, \"auto\": 116195, \"text\": 412390, \"align\": 412390, \"float\": 111345, \"width\": 111345, \"40\": 18494, \"border\": 192367, \"solid\": 192367, \"center\": 137283, \"hidden\": 166172, \"span\": 412390, \"font\": 412390, \"weight\": 206195, \"bold\": 206195, \"size\": 206195, \"150\": 115487, \"30\": 18346, \"45\": 8689, \"20\": 19682, \"200\": 90708, \"50\": 18253, \"25\": 8565, \"55\": 9229, \"35\": 8736, \"60\": 308, \"15\": 146, \"65\": 145, \"70\": 266, \"80\": 8, \"relative\": 31890, \"c''\": 31890, \"time\": 31890, \"c2\": 54204, \"g8\": 51771, \"c4\": 52173, \"g4\": 51664, \"b16\": 38751, \"r4\": 42908, \"a16\": 39098, \"b8\": 51713, \"bis16\": 982, \"c8\": 52118, \"a8\": 51751, \"d8\": 52233, \"d4\": 51930, \"a2\": 51914, \"e16\": 38547, \"e2\": 52021, \"f4\": 51619, \"d2\": 52126, \"c16\": 39089, \"g2\": 51905, \"e4\": 51885, \"f8\": 52096, \"a4\": 51985, \"d16\": 39237, \"b2\": 51813, \"r8\": 42518, \"b4\": 51545, \"r16\": 31732, \"f2\": 51966, \"g16\": 38673, \"r2\": 42881, \"e8\": 51641, \"ees8\": 1378, \"des2\": 1385, \"f16\": 38909, \"key\": 3020, \"major\": 1476, \"bis2\": 1451, \"eis16\": 1025, \"ees16\": 997, \"fes8\": 1315, \"cis2\": 1366, \"ges2\": 1423, \"fis2\": 1413, \"ces16\": 1024, \"ais2\": 1362, \"bis4\": 1422, \"gis8\": 1440, \"gis16\": 982, \"fes16\": 1022, \"aes16\": 1074, \"fis16\": 1027, \"cis8\": 1322, \"fis4\": 1368, \"cis4\": 1277, \"ees4\": 1411, \"eis4\": 1386, \"bes4\": 1379, \"ces2\": 1331, \"ais4\": 1386, \"dis2\": 1351, \"dis8\": 1337, \"dis4\": 1381, \"des8\": 1403, \"bes2\": 1432, \"aes2\": 1392, \"ces4\": 1361, \"ais8\": 1359, \"fes2\": 1328, \"gis4\": 1386, \"cis16\": 1000, \"aes4\": 1392, \"aes8\": 1363, \"bes8\": 1368, \"minor\": 1544, \"des4\": 1429, \"fes4\": 1357, \"bes16\": 1037, \"dis16\": 1073, \"fis8\": 1385, \"eis8\": 1379, \"ges4\": 1335, \"ges8\": 1393, \"eis2\": 1437, \"ees2\": 1415, \"gis2\": 1441, \"ais16\": 1006, \"ges16\": 1064, \"ees\": 5, \"ces8\": 1380, \"bis8\": 1340, \"des16\": 1062, \"bis\": 7, \"fis\": 10, \"bes\": 7, \"eis\": 13, \"aes\": 16, \"cis\": 8, \"ces\": 10, \"fes\": 6, \"ais\": 4, \"ges\": 8, \"des\": 8, \"gis\": 4, \"dis\": 5, \"c1ccn2c\": 6, \"c1\": 4935, \"ccc\": 1528, \"c1ccccc1\": 1859, \"cc\": 9315, \"cc1\": 3466, \"occ\": 933, \"co\": 759, \"o1\": 327, \"12oc\": 7, \"1c\": 407, \"1ccc1\": 6, \"21c\": 8, \"na\": 998, \"nc1ccc\": 329, \"nc2ccc\": 105, \"nc3ccc\": 62, \"4c\": 39, \"c5ccc\": 17, \"nc\": 2087, \"c6ccccc6\": 16, \"cc5c\": 6, \"c7ccc\": 9, \"cc37\": 1, \"c8ccc\": 7, \"cc28\": 1, \"clc1ccc2oc3ccc\": 2, \"cl\": 5987, \"cc3oc2c1\": 2, \"cc12ccc3c\": 21, \"ccc4\": 75, \"c3c\": 161, \"c1ccc2o\": 6, \"c1ccc2c\": 180, \"3c\": 45, \"c4c\": 51, \"c5ccccc5\": 16, \"cc4c\": 22, \"c3\": 581, \"clc1\": 157, \"oc2\": 131, \"c1c\": 739, \"c2c1cccc2\": 190, \"clc\": 85, \"ncccnccsp\": 2, \"c1ccccc1i\": 5, \"cn1ccn\": 137, \"c1c2ccccc2sc2c1cccc2\": 2, \"ccn\": 550, \"ccn1cnc2c1c\": 2, \"n2c\": 135, \"fc1\": 22, \"ccn1cccc1cnc\": 6, \"c1cc\": 383, \"cc1oc\": 94, \"c1cccnc1\": 74, \"c1ccc\": 1277, \"c2nc\": 21, \"nccnc3ccc4n\": 2, \"c5c\": 21, \"c6oc7c\": 2, \"nccnc8nc\": 2, \"nc9cc\": 3, \"ccc9\": 1, \"n8\": 3, \"10cccc\": 2, \"c7\": 18, \"c6c\": 7, \"c5oc4c3\": 2, \"11cc\": 2, \"11\": 9, \"n2\": 271, \"cccccc\": 139, \"oc1\": 190, \"cc1ccoc1\": 1, \"nc2c\": 38, \"br\": 940, \"cc2br\": 5, \"c1nc2ccc\": 8, \"cc2c\": 71, \"1o\": 364, \"1scc\": 13, \"c2c\": 503, \"coc\": 835, \"c1ccco1\": 26, \"csc\": 46, \"1ccccc1\": 37, \"nh\": 1063, \"oh\": 49, \"ccoc1\": 26, \"c2oc3c\": 8, \"cc4c5cc\": 2, \"c2c43ccn5c\": 5, \"zn\": 47, \"cn\": 874, \"cn1c2ccccc2ccc2c1cccc2\": 1, \"clc1cc\": 86, \"cc1c1ccccc1\": 3, \"ru\": 3, \"brc1cnc\": 3, \"occccccnccss\": 3, \"occn\": 110, \"cco\": 276, \"c1nc\": 158, \"cc2\": 863, \"c4ccc\": 38, \"nc5nc\": 16, \"nc6ccc\": 11, \"cc6\": 10, \"n5\": 18, \"cc3\": 226, \"n1\": 563, \"cc1ccc2\": 4, \"c2n1c\": 5, \"ncccnc\": 4, \"css\": 39, \"ccc1ccccc1\": 68, \"oc\": 3083, \"2o\": 118, \"o2\": 116, \"cn1cc2ccc\": 11, \"n2ccoc\": 2, \"ccccccccc\": 68, \"nnc\": 80, \"ccnc\": 75, \"clccn\": 98, \"1cccc\": 23, \"1oc\": 42, \"cc1ccc\": 318, \"ccccc1cc2ccccc2c\": 2, \"cc1n\": 71, \"ccoc1c1ccccc1\": 3, \"cc1c\": 259, \"cc3c4ccc\": 1, \"ccc3c2\": 5, \"occc\": 42, \"oc1ccc\": 226, \"c2ccccc2\": 268, \"2cc\": 144, \"1cc\": 217, \"2c\": 187, \"coc1c\": 66, \"cnc\": 289, \"cs\": 93, \"cccn1c2ccccc2sc2c1cc\": 30, \"occo\": 19, \"oc1ccc2c\": 87, \"occ2ccccc2o1\": 1, \"coc1cc2c\": 31, \"c1scn\": 1, \"cn1cc1ccccc1\": 1, \"cc1ccccc1\": 288, \"cop\": 46, \"cc1cc\": 209, \"ccc1o\": 63, \"ccn1ccccc1\": 43, \"ccsc1ccc2c\": 4, \"cccn1ccn\": 13, \"s2\": 79, \"cccc1\": 218, \"ccc1\": 254, \"nc1\": 569, \"c2cc\": 104, \"13cccc\": 57, \"ccc1ccc\": 52, \"n1c\": 138, \"cccccc1ccc\": 6, \"c2ccc\": 245, \"coc1\": 172, \"c2oc\": 15, \"c1oc\": 148, \"s1\": 125, \"c1scc\": 8, \"cn1ccocc1\": 24, \"coc1ccc\": 280, \"occnc\": 20, \"cc1cccc\": 81, \"ccoc\": 540, \"c1cnn\": 1, \"nc2nc\": 31, \"si\": 127, \"nc3cc\": 15, \"nc5ccc\": 9, \"cc5\": 42, \"c34\": 17, \"c1ccccc1o\": 44, \"c1cc2c\": 25, \"clc1cccc\": 58, \"cc2cl\": 63, \"c34ccn5cc6\": 1, \"ccoc7cc\": 1, \"n2c3c7c6cc45\": 1, \"nccnccn\": 2, \"nc1ncc2nccnc2n1\": 1, \"ccc1c\": 92, \"cccl\": 115, \"cu\": 31, \"ccc1nnc\": 2, \"nc2cc\": 38, \"c3nc\": 1, \"n3\": 33, \"nc6cccc\": 2, \"c6\": 32, \"c7ccccc7\": 6, \"nc1nccc\": 3, \"c1ncc\": 17, \"31c\": 1, \"3o\": 25, \"2ccc2\": 48, \"12c\": 86, \"cncc\": 36, \"cnccoc\": 3, \"c1ccc2sc3ccc\": 1, \"cc3n\": 4, \"cccn4ccc\": 1, \"cc4\": 107, \"c2c1\": 65, \"c1ccn\": 33, \"cc1coc2\": 20, \"c1ccccc1occ1c2cccc1\": 8, \"cn1c\": 141, \"nc2\": 255, \"ccbr\": 25, \"c2o1\": 8, \"c1cccc2c1cccc2\": 53, \"c1ccccc1c2c3ccc\": 1, \"c4cc\": 19, \"ccc24\": 2, \"cccccccccccccc\": 22, \"cccoc1\": 6, \"c3occ\": 1, \"oco5\": 1, \"coc1ccccc1occncc\": 2, \"coc1cccc2c1c1ccccc1\": 2, \"n2ccocc2\": 12, \"cccccoc1ccc\": 7, \"cc1occ\": 12, \"no\": 99, \"fc\": 92, \"n1ccc\": 28, \"ccccccc\": 111, \"ccccccc1\": 9, \"nccc\": 29, \"ccccccccccccccccnc\": 1, \"c1c2cccc1\": 19, \"occcccnccss\": 17, \"nc2c1cccc2\": 23, \"ba\": 14, \"cc3ccccc23\": 36, \"csccc\": 7, \"cccnc\": 32, \"coc1cc\": 197, \"c2c1oc\": 10, \"cccc\": 628, \"cccccccn\": 4, \"nc1c\": 142, \"c1ccccc1c\": 104, \"nc1ccs\": 1, \"1ccc2c\": 16, \"cccc2\": 306, \"brccn\": 19, \"ncccnccccn\": 2, \"nccoc\": 3, \"cc12cc3cc\": 21, \"cc12\": 15, \"cnn1c\": 2, \"cocc\": 41, \"brc1cccnc1occcccn1cscc1\": 1, \"oc1cc\": 91, \"n1c2ccccc2sc2c1nccc2\": 8, \"c2ccccc2nnc3\": 1, \"c2cc3ccccc3cc12\": 1, \"cos\": 20, \"n1cnc2c1ncnc2n\": 6, \"nccncc\": 1, \"cc1nc\": 26, \"csc1ccc\": 13, \"nn1\": 25, \"fe\": 47, \"cc2ccc\": 20, \"cc3ccc\": 6, \"nc1cc\": 62, \"c2c1c\": 23, \"ccccc1c\": 15, \"sccn\": 11, \"oc1n2ccc\": 2, \"cc1ccco1\": 10, \"12cc\": 32, \"c3cc\": 31, \"1ccc2\": 18, \"oc1ccccc1\": 78, \"cccn\": 88, \"nccn\": 17, \"ccl\": 102, \"ccoc1cc\": 15, \"ccccc1\": 89, \"c1c1ccccc1\": 11, \"cccccnccoc\": 2, \"nh2\": 113, \"c1cccc\": 207, \"c1cn\": 42, \"cc1cccc2c1cccc2\": 10, \"cccoc1ccc\": 15, \"occcn1ccccc1c\": 28, \"c2ccccc2sc2c1cc\": 21, \"cc1cccnc1\": 2, \"clc1ccc\": 239, \"cc1cl\": 169, \"nc1ccncc1\": 7, \"no1\": 8, \"nncc2\": 1, \"ccc1ccc2c\": 6, \"ic1ccccc1c1ccccc1\": 1, \"c3ccccc3c\": 27, \"clccn1ccocc1\": 2, \"cc3ccccc3\": 9, \"os\": 77, \"sccnccoc1ccccc1\": 1, \"brc1ccc\": 42, \"occcccccnccss\": 1, \"coccocccn1c\": 1, \"c4ccccc4c\": 20, \"clcc1co1\": 2, \"c1cl\": 239, \"ccccccoc\": 27, \"cc2o\": 5, \"op\": 62, \"nc1ccnc2c1ccc\": 7, \"c1cc1\": 18, \"fc1ccc\": 42, \"1sc\": 25, \"ccoc1cc2c\": 1, \"c2ccc1ccc\": 13, \"c2cccc\": 29, \"oc3ccccc3\": 25, \"brc\": 10, \"c2cl\": 150, \"cccoc\": 63, \"nn\": 154, \"on\": 40, \"c1occc1\": 6, \"c1ncc2nccnc2n1\": 1, \"cccc1ccc\": 11, \"cccccccccccccccccc\": 33, \"la\": 7, \"c1nc2c\": 20, \"clc1ccc2c\": 77, \"occcn1cscc1\": 6, \"nh3\": 43, \"ccc4cc\": 13, \"ccc34c\": 12, \"ca\": 72, \"oc1c2cccc1\": 1, \"ccc1cc\": 34, \"nc1ccccc1\": 120, \"cc1ccnc2c1\": 1, \"n2c2cc2\": 1, \"nccc1\": 6, \"ccccs\": 6, \"cccco\": 21, \"occcc\": 54, \"c1n\": 153, \"nc3ccccc3\": 21, \"ccc1n\": 36, \"nc2ccccc2\": 50, \"cccccccsccccccn1ccsc1\": 1, \"ccccccccccccn\": 9, \"nc1ncccc1c\": 8, \"ccccn1c\": 14, \"c2ncn\": 4, \"cc34ccc1c\": 1, \"ccc2\": 56, \"ccc12o\": 2, \"c3ccc4\": 8, \"c2sc\": 4, \"nc1nnc\": 9, \"cccccccccc\": 47, \"ooc\": 41, \"c3ccccc3\": 86, \"clcc\": 60, \"nc1cccc\": 52, \"oc1ccn\": 6, \"cccc1cl\": 43, \"oc1c\": 94, \"cc1cc2ccccc2\": 2, \"ccoc1ccc\": 78, \"ic1\": 4, \"li\": 46, \"cccccccc\": 194, \"oc2ccc\": 33, \"oc3ccc\": 9, \"cn1c2ccccc2c\": 3, \"1ncc2ccccc12\": 1, \"nc1cnc2c\": 1, \"clc1cc2c\": 2, \"c1ccccc1cn\": 1, \"ccc1oc\": 38, \"ocn1c\": 41, \"ccccn1ccc\": 28, \"c1f\": 21, \"o3\": 32, \"nccc2c1cccc2\": 1, \"c2c3c1cccc3ccc2\": 2, \"cccccccccccccnccss\": 1, \"ccoccc\": 9, \"cc1ncnc2nc\": 1, \"c12\": 76, \"c1ccc2cc3c4ccccc4c5ccccc5c3cc2c1\": 1, \"ncc1c\": 9, \"c1o\": 235, \"ccccococccc\": 1, \"cc1o\": 49, \"cccc1nc\": 4, \"n1ccocc1\": 38, \"ns\": 86, \"nc2n1cccc2\": 2, \"nccssccnc\": 3, \"cccccsc1ccc\": 1, \"c1cc2ccc1c2\": 1, \"n3c2\": 1, \"c1i\": 43, \"ccc1c2nccn1\": 1, \"2ccc2c1ccc\": 6, \"c21c\": 2, \"ccns\": 3, \"c1c2\": 23, \"cccccccccccccccccccccc\": 8, \"ccccc\": 295, \"cccccccccccccccc1cccc\": 1, \"ccccccc2cccc\": 1, \"ccccccc3cccc\": 1, \"oc4cccc\": 1, \"ccop\": 43, \"n1cc\": 38, \"cc2c1cccc2\": 50, \"cc1ccc2c1c\": 1, \"1cccn1\": 1, \"c1csc\": 6, \"occn1ccocc1\": 4, \"1c2\": 13, \"sc3\": 6, \"cccccccoc\": 20, \"1n1ccc\": 1, \"ccn2c1cc\": 3, \"ccc1nc\": 13, \"c3cccnc23\": 12, \"ncc1ccc\": 21, \"sc1c1ccccc1\": 1, \"hg\": 20, \"ccccc1ccccc1\": 6, \"ccc2oc23c\": 1, \"c4ccc13c4\": 1, \"coc1nc\": 9, \"1ccccn1\": 6, \"nccccccnccss\": 1, \"12\": 32, \"cd\": 8, \"cccccccccccnc\": 1, \"c1ccccccc1\": 3, \"ccco\": 23, \"cc4ccccc34\": 2, \"c1cccccccn1\": 2, \"1cn\": 15, \"c1cccc3c1c\": 6, \"c1coc2\": 4, \"ccc3\": 14, \"cn1\": 49, \"cc2n\": 9, \"c1ccncc1\": 26, \"cn1occ2c\": 4, \"nh4\": 36, \"mo\": 26, \"scc\": 40, \"coccoc1cnc\": 1, \"cnc2c1nccn2\": 1, \"oc1ccccc1c\": 31, \"cocco\": 4, \"occoc\": 34, \"brcc\": 11, \"ccc1cl\": 17, \"c3ccccc23\": 11, \"cccns\": 1, \"nccoc1ccc\": 2, \"mgh2\": 1, \"ccccco\": 8, \"ccc1nn\": 3, \"n1ccoc1ccccc1\": 1, \"cc1ccc2c\": 65, \"c1br\": 22, \"c2br\": 11, \"al\": 37, \"ccn1c2ccc\": 3, \"con\": 13, \"ncc\": 204, \"sc1ccccc1\": 8, \"ccnc1ccc\": 5, \"ccc2c3ccc4\": 10, \"cc12c\": 8, \"occ1oc\": 26, \"co3\": 6, \"nc3\": 41, \"1cc2\": 6, \"coc1cccc2c1cccc2\": 4, \"oc1cccc1\": 2, \"ccccn\": 44, \"nnc1nncc2c1cccc2\": 2, \"c12ccccc1nccc2c\": 1, \"c3n\": 8, \"ccco2\": 2, \"cn1ccc\": 45, \"c1ccccc1c2\": 10, \"c3oc4c\": 3, \"cc24\": 8, \"c5ccccc5c6\": 1, \"c7c\": 7, \"c7oc8c\": 2, \"cc68\": 1, \"c9ccccc9c\": 2, \"11c\": 6, \"11oc\": 1, \"oc1occ\": 2, \"c1nc4cc\": 2, \"c6ccccc6c\": 7, \"c45\": 11, \"cc1sccc1\": 2, \"ccoc1ccccc1\": 12, \"c1nn\": 7, \"cc1c1c\": 2, \"ccc12cc3cc\": 10, \"cc1c1cc\": 2, \"n2n\": 10, \"cc3c\": 30, \"nc4cc\": 25, \"c5cl\": 1, \"c13\": 10, \"c1ccccc1cc2\": 10, \"5c\": 8, \"cc6ccccc56\": 4, \"cc4cl\": 9, \"ccnc1nc\": 30, \"clc1ccc2oc3c\": 2, \"c3oc2c1\": 3, \"cn1ccccc1c\": 4, \"cccc1c\": 89, \"c2c1cc1ococ1c2\": 6, \"2co\": 5, \"c1cccs1\": 30, \"ocsc1\": 9, \"c1cccc1\": 19, \"oc3c\": 12, \"c23\": 37, \"ccnc1ccccc1\": 4, \"cn1c2ccc1cn\": 13, \"c3oc\": 7, \"c2f\": 28, \"cn3c2cc2\": 11, \"nn1cccc1\": 5, \"cccoc1nn\": 2, \"nc1cccc1\": 1, \"ccn1c2ncccc2c\": 3, \"c2c1nc\": 9, \"c2n\": 32, \"se\": 13, \"nc2c1\": 14, \"ccccbr\": 1, \"occ2ccccc2\": 8, \"coc1ccc2c\": 98, \"cc2cccc\": 10, \"c1ccccc1cl\": 49, \"cnc1c\": 3, \"c2c3n\": 1, \"c4n5\": 1, \"n6c\": 2, \"c7n\": 1, \"c5c8c\": 1, \"c48\": 1, \"c9c\": 3, \"c79\": 1, \"10c\": 8, \"10c6\": 1, \"c2c1cl\": 9, \"12ccc\": 19, \"c1ccnc2c1cc\": 23, \"clccc\": 4, \"c4ccccc4\": 32, \"nccnc2ccccc2\": 1, \"ncccncc\": 3, \"csp\": 6, \"oc2ccccc2\": 44, \"cccccccccccccccoc\": 3, \"occccccccccccccc\": 1, \"cn1cc\": 40, \"c21\": 5, \"ccn1ccn\": 22, \"c1ccccccn1\": 1, \"cnc1nc\": 7, \"ccoccc1ccc\": 1, \"occnc2ncnc\": 1, \"ccccoccc\": 2, \"coc1ccccc1o\": 3, \"coc1ccccc1\": 26, \"31o\": 5, \"2c1ccc\": 10, \"occ1cc2ccc\": 1, \"nc2cc1\": 1, \"cn1cccc\": 10, \"cccccoc1cc\": 1, \"c1ccccc1oc\": 10, \"ncc1cnc2c\": 3, \"clc1ccc2cc\": 3, \"cc2c1\": 13, \"cbr\": 32, \"occ2\": 12, \"cccsc1\": 1, \"c1s\": 5, \"ccn1c\": 84, \"ococ\": 6, \"3cc\": 37, \"ccccccccccccco\": 1, \"cn1ccccc1\": 26, \"ccccsc\": 3, \"scc1ccc\": 2, \"nc2cccnc2\": 1, \"sccnc1cccccc1\": 1, \"ccccnc\": 25, \"c1cccc3c1\": 3, \"nccoc1ccccc1\": 1, \"nccs1\": 4, \"cn1cccc1\": 18, \"c1ccccn1\": 61, \"1cn2cc\": 16, \"oc1cccc\": 53, \"ncccncccsp\": 4, \"ccccc1ccc\": 8, \"c1oc2c\": 6, \"1ccocc1\": 13, \"c2ccccc2c\": 19, \"cc2c1cc\": 4, \"occ1cc\": 9, \"c1ccccc1occ\": 7, \"occcccccc\": 18, \"ccccccccccccccccccnc\": 6, \"ccccccccccc\": 27, \"cc2c2\": 1, \"cco2\": 7, \"cscc\": 10, \"c2o\": 55, \"n1cnc2c1nc\": 2, \"nc2n\": 18, \"c1cc2\": 11, \"clccnc\": 3, \"ccnccss\": 3, \"occ1ccccc1\": 25, \"nn2\": 4, \"ccn1cc\": 49, \"23\": 75, \"1cc1c3cc\": 48, \"c2c3cc4\": 1, \"oc1c25ccn3c\": 1, \"ccccccccccccccc\": 24, \"cccccccccccc\": 55, \"nc1ccc2c\": 44, \"1c1cccnc1\": 1, \"occn1c\": 9, \"cnc1\": 34, \"cccccc1\": 15, \"c1cn1ccocc1\": 1, \"n3ccn\": 11, \"ccsccccccn1cscc1\": 1, \"sn\": 42, \"brc1cccc\": 7, \"ccccccoc1\": 3, \"nc2cccc3cccc\": 2, \"c1c2ccccc2cc3ccccc13\": 2, \"mn\": 19, \"sc2c\": 7, \"n2c1c\": 6, \"ncco\": 31, \"coc1cccc\": 51, \"clccn1cnc2c1c\": 1, \"1cnc2ncncc12\": 1, \"ccccccccccccccco\": 4, \"as\": 35, \"cnc1cccc\": 2, \"ccccoc1ccc\": 48, \"clc1ccccc1occnc1cc1\": 1, \"nc1ccccc1c\": 25, \"nc1ccc1\": 2, \"c1csccs1\": 1, \"occn1occ2c\": 2, \"cccocc\": 6, \"coc1ccccccccccc1\": 2, \"cccc1cc\": 17, \"occccn1cscc1\": 2, \"nnc1nc2c\": 1, \"nc1c2c\": 4, \"nc4cccc\": 8, \"1n2c\": 12, \"cocc1ccc\": 6, \"ccncc\": 11, \"ccc2c\": 19, \"c1ccc2\": 25, \"cccn3ccc4\": 1, \"c32\": 6, \"n1c1\": 1, \"nco\": 5, \"c1occ\": 33, \"cc12cc3\": 6, \"c2cccc2\": 5, \"clcc1nc2cc\": 1, \"cc2s\": 8, \"cn3c\": 1, \"nccccccn\": 5, \"coc1cc2nc\": 4, \"c2cc1oc\": 10, \"n1ccn\": 71, \"n1cc1\": 39, \"occoccn1ccn\": 6, \"ccs\": 29, \"cnc1ccc\": 11, \"ic1ccc\": 15, \"scccccn1cscc1\": 5, \"nc1ccccc1occoc2ccccc2n\": 1, \"nc3ccc4nc\": 2, \"nc4c3\": 2, \"nc5ccc6nc\": 1, \"nc6c5\": 1, \"ti\": 13, \"gd\": 5, \"ccncc1\": 5, \"cccc3o\": 9, \"c1ccc1\": 2, \"nc1ccccn1\": 11, \"clc1nc\": 4, \"c1ccccc1n2cc\": 2, \"coccoccoccoccoccoccoccoccoccoc\": 1, \"ncccc\": 27, \"n1nc\": 8, \"ncc1ccccc1\": 24, \"ccc1sccc1\": 1, \"c3ccccn3\": 2, \"csc1ccccc1\": 5, \"c2ccccc2n1\": 3, \"c1nsc\": 1, \"ncc1ccoc1\": 1, \"c2cnc\": 2, \"nc12\": 11, \"n3ccncc3\": 4, \"oc1nn\": 2, \"cccoc1c\": 5, \"cccc3cc\": 3, \"ccc23\": 10, \"ccccocn\": 2, \"ccccccnc\": 2, \"cccccccccco\": 4, \"cnc2ccc\": 2, \"cnc2c1c\": 1, \"ccocc1\": 17, \"ccoc1cccc2c1cccc2\": 1, \"cccc1cccc\": 5, \"c1c2ncccc2c2c\": 1, \"nccc2\": 10, \"cn2cc1ccccc1\": 1, \"cc1ccccc1br\": 4, \"sn1c\": 4, \"ccc2c1\": 17, \"c1nsc2ccccc12\": 1, \"34\": 21, \"cccoccc\": 10, \"cc1ccccc1occ\": 5, \"cc3ococ3c2oc\": 1, \"n3csc\": 2, \"ccsc\": 23, \"cc1c2\": 3, \"n1ccccco1\": 1, \"ccos\": 3, \"cc2c1ccc\": 1, \"nc3c\": 13, \"c5ccccc5c\": 10, \"c24\": 9, \"fcc\": 7, \"c2ccccc2s\": 4, \"c2c1cc\": 18, \"fc1cc\": 7, \"nc1ccccc1cl\": 9, \"cccn1cc\": 2, \"c2cc3cc1cc\": 3, \"3n\": 16, \"cc1br\": 13, \"ccocc\": 55, \"ccccccn\": 9, \"n1ccncc1\": 12, \"clc1cccc2c1nc\": 2, \"occcccn1cscc1\": 10, \"nc1cn\": 5, \"occn1ccn\": 40, \"cccn1c2ccccc2c\": 4, \"nc1nc2c\": 11, \"nn1c\": 8, \"23c\": 4, \"nccccss\": 1, \"ncc1ccccc1cl\": 5, \"nc21ccccc2\": 1, \"c1oc1coc2cccc\": 1, \"cc3co3\": 3, \"cc4co4\": 2, \"ccccccco\": 5, \"cc1cccc1\": 10, \"ocnc\": 5, \"au\": 4, \"cocc1cnc\": 1, \"cc2ccccc2\": 28, \"nnc2\": 2, \"n1cnc\": 5, \"1cnc2ccccc12\": 1, \"cccccccnc\": 1, \"occ1occo1\": 2, \"1ccc\": 33, \"c1c2ccccc2c2c1cccc2\": 20, \"coc1cc2o\": 1, \"c2c2c1c1ccc\": 1, \"c1ccsc1\": 2, \"occn1cccccc1\": 1, \"oo\": 15, \"cc1cnc\": 29, \"ccc1cccc\": 15, \"ccccccc1ccc\": 5, \"coc1cccc2c1c\": 9, \"o4\": 6, \"occnccnc1ccc\": 1, \"nccncco\": 3, \"ccncc1ccc2c\": 5, \"coccncc\": 1, \"icc\": 2, \"nc4\": 10, \"sccccccccccn1cscc1\": 3, \"occcn\": 7, \"coc1ccccc1c\": 41, \"c1ccccc1c2ccccc2c\": 1, \"ccc1sc2\": 2, \"c1ccccc1f\": 15, \"c2ccccc2c1\": 13, \"c1c1c\": 4, \"ccc1occo1\": 1, \"ncnc1\": 2, \"cccc1c2ccccc2ccc2c1cccc2\": 2, \"n1cnc2c1\": 6, \"cnc2\": 32, \"occccoc\": 6, \"nccc2nc1ccc\": 1, \"c1nccs1\": 5, \"c2ccc1cccc\": 2, \"co1\": 16, \"cncc1coc2\": 4, \"c1ccccc1ccc1c2cccc1\": 15, \"brc1ccccc1br\": 2, \"c1sc2c\": 2, \"ccccc2\": 22, \"c1cnc\": 20, \"n1c1ccccc1\": 17, \"ccc3ccc4ccccc4c23\": 1, \"cr\": 24, \"cc1ccccc1oc\": 2, \"sccncccoc1ccc\": 1, \"c1ccccccccn1\": 1, \"c1ccccc1cc2ccccc2\": 1, \"nc4ccccc4\": 16, \"sc2ccccc2\": 3, \"c5\": 66, \"cc6ccccc6c\": 5, \"nc7cc\": 5, \"ccc7cl\": 3, \"ccccccccccccccn\": 2, \"o2c1ccccc1n\": 2, \"1ccn\": 11, \"1cc2ccccc2sc2c1cc\": 4, \"c1c2ccccc2n\": 3, \"ccn1ccocc1\": 21, \"ccc1nnc2\": 1, \"c3c2\": 6, \"ccccc4\": 2, \"nnc6\": 1, \"c7c6\": 2, \"ccccoc1\": 4, \"cccncccn\": 1, \"ccc1oc2ccc\": 5, \"cccccn\": 7, \"ccccoc\": 70, \"c1cccccn1\": 1, \"sc1\": 35, \"coc1ccc2ccccc2c1\": 2, \"ccc1occ\": 11, \"scn2\": 2, \"ccc2c3cc\": 1, \"c3ccc12c\": 18, \"c1oc2\": 8, \"occ2c1cc1c3nc4ccccc4cc3cn1c2\": 1, \"cn3c4\": 2, \"c1cn2c\": 3, \"n2nc3ccccc3n2\": 7, \"nc3cccc\": 6, \"c1ccc2ccc3cccc1c23\": 1, \"ncc1n2cnn1\": 1, \"occ2cccc\": 3, \"cccn1ccc\": 24, \"fccccc\": 2, \"nccnc\": 11, \"cccc2cl\": 12, \"c1c2cc3cc1cc\": 2, \"c1c2ccccc2c3ccc4ccccc4c13\": 1, \"clc1c\": 34, \"cccc1c1cccc\": 1, \"ccc34\": 17, \"occn1ccccc1\": 9, \"cc12ccc\": 17, \"c1ccc1c2ccc2\": 3, \"ccc12\": 14, \"ccccccccoc\": 22, \"c3ccc\": 84, \"cc3c4ccccc4c5cccc2c35\": 1, \"ccccocc\": 6, \"cocccc\": 2, \"ccc12ccn\": 1, \"cc1c2cc\": 4, \"cn1cccn\": 7, \"ccccccccccccoc\": 10, \"cccccccccccccnccccccccccccc\": 1, \"cccccccccccccncc\": 1, \"ccccnc1cc\": 2, \"ncn2cccc2\": 1, \"cccc2o\": 5, \"coc1ccc2c3c1o\": 14, \"43ccn\": 14, \"4ccc1\": 1, \"cccccoc\": 30, \"cn1c1\": 7, \"csc1cc\": 3, \"c2ccncc2\": 5, \"ccccccccc1ccccc1\": 1, \"ccc3ccccc23\": 4, \"2ccn3\": 1, \"oc1nc\": 5, \"oc3cc\": 6, \"cc3c25oc\": 1, \"c6ccccc56\": 2, \"oc2cccc3c2c2oc\": 1, \"c4c5c2c\": 1, \"c3o\": 16, \"oc5ccc4c\": 2, \"c3ccc4c\": 3, \"c4c3n2\": 1, \"c7ccc8c\": 1, \"c8c7n6\": 1, \"c1ccc3c4c1c\": 1, \"ccc4ccc3\": 3, \"cc1nccoc1c1ccccc1\": 2, \"nc1cccc2c1ccn\": 1, \"ic1cc\": 4, \"n1c2ccc1cn\": 26, \"occccccn1cscc1\": 4, \"scc1\": 7, \"c1cccnc1nc1cccc\": 2, \"3ccc4\": 19, \"c1cc2ccccc2c1\": 1, \"cn3ccocc3\": 6, \"cs1\": 12, \"sr\": 12, \"cccccccbr\": 2, \"c1no\": 1, \"c1cssc1\": 2, \"c3ccc4ccc5cccc6cc2c3c4c56\": 1, \"cc1c2c\": 2, \"cc23\": 7, \"n1c2cccnc2sc2c1cccc2c\": 1, \"c12cc3cc\": 6, \"rh\": 7, \"ccccccccnc\": 5, \"n1ccccc1\": 38, \"ocn1cnc2c1c\": 1, \"occcnccss\": 10, \"c1cccn1c\": 7, \"cocc2cccc\": 1, \"c2cn\": 6, \"cc3cccc1\": 1, \"cn1cnc2c1c\": 10, \"c1nnn\": 4, \"1co\": 9, \"cn2cncn2\": 8, \"cc3cl\": 11, \"mg\": 20, \"1ccccc1c\": 3, \"cnncc1ccccc1\": 1, \"fc1ccccc1ccl\": 1, \"ccc1c2cccc1\": 24, \"coc1ccccc1nc\": 8, \"co2\": 13, \"ccccccccccccccccnccss\": 1, \"c3oc2c1cl\": 1, \"occ1\": 24, \"n1occ2c\": 4, \"c1ccc1ccc\": 8, \"nc4ccc\": 34, \"4cc\": 13, \"ccnc1cnnc\": 1, \"c1ccoc2c1cccc2\": 1, \"cc1nn\": 8, \"c4ccccc24\": 2, \"c3cccc\": 10, \"c1occo1\": 3, \"cccc1oc\": 4, \"c1ccc2oc\": 7, \"c3sc\": 1, \"c4oc5ccc\": 1, \"cc5n4\": 1, \"n1c2ccccc2ccc2c1cccc2\": 3, \"cc3c4cc\": 1, \"occ1c\": 14, \"nc2ccccc2c2c\": 1, \"c1cccn1\": 6, \"2n1c\": 5, \"2nc\": 4, \"ccnc1c2ccc\": 2, \"occoccoc\": 7, \"c1ccccc1nc2cccc\": 1, \"c2c3ccccc3c\": 3, \"cc3c2cccc3\": 2, \"cc1cc1\": 6, \"ccccccccscc1cc\": 1, \"cscccccccc\": 1, \"cc1nc2c\": 3, \"cc1c2cccc1\": 17, \"csc1\": 17, \"pd\": 10, \"ch\": 23, \"ccn2ccn\": 15, \"c1ncnc2nccnc12\": 1, \"clc1ccccc1\": 4, \"ccn1ccn2c\": 6, \"c2oc3\": 4, \"c3oc2\": 3, \"c1ccccc\": 1, \"cnc1cccccc1\": 1, \"cc1c2ccccc2c\": 2, \"oc1ccc2ccccc2c1\": 6, \"occcn1cc\": 1, \"fc1ccccc1f\": 1, \"oc1cn2ccc1cc2\": 3, \"coccoc1c\": 2, \"cc2cnc\": 12, \"cn1c2ccccc2sc2c1cccc2\": 16, \"cccnccn1ccocc1\": 1, \"nc1ccc2snnc2c1\": 1, \"ccoc1ccccc1o\": 2, \"oc1sc\": 1, \"nc2ccccn2\": 2, \"nc1cccc2nc3ccccc3cc12\": 1, \"c3ccccc3c2\": 10, \"occc2c1cccc2\": 2, \"cc1cc2cccs\": 1, \"c2cc1s\": 11, \"coccc\": 8, \"nc9ccc\": 5, \"cc9\": 2, \"cc1ncnc2c1\": 1, \"cn2\": 36, \"cc1oc1c2oc2c\": 1, \"ccccccccccscco\": 1, \"nccccccnccccccccccc\": 1, \"oc1cc2ccc\": 19, \"oco2\": 30, \"coc1cccc2c1cc\": 2, \"ccoccncc1\": 1, \"ocn2c\": 3, \"n2cc\": 11, \"cccn1c\": 24, \"c2ccccc2c3ccccc3\": 1, \"occ1ccccc1co\": 1, \"ccccccccccccc1co1\": 1, \"cscs\": 2, \"c1n2c\": 1, \"ocn1c2ccc1cn\": 1, \"fc1ccc2c\": 5, \"ccccccccccccccccccn1c\": 1, \"c2ccc3sc4ccccc4c5ccc\": 1, \"c2c35\": 1, \"cccn2ccc3\": 1, \"cnc3\": 3, \"c1sc\": 16, \"fc1ccccc1br\": 2, \"ccncc1ccccc1\": 5, \"2ccc3c\": 2, \"cccc3\": 19, \"cc1c2ccc\": 2, \"c12oc1\": 4, \"nccss\": 15, \"nc1sc2ccccc2n1\": 2, \"cc2c3ccc4\": 4, \"cccoc1ccccc1occ\": 1, \"nccc1ccccc1\": 9, \"cc1cnccc1c\": 1, \"cc1sc1ccc\": 3, \"oc3\": 24, \"ccoccc1ccc2cc1c2\": 4, \"c3cl\": 10, \"1nc\": 16, \"cns\": 2, \"oc2c1cccc2\": 14, \"cn1ccc23c4oc5\": 1, \"c25\": 2, \"cc1c3c\": 1, \"cc4o\": 2, \"cn1c2cc\": 8, \"2cn\": 5, \"ccc3c1\": 2, \"c1c3cccc1\": 1, \"cccnccc\": 3, \"coccccc2ccccc2\": 1, \"1cccc1c1c\": 2, \"ccccccccbr\": 2, \"nc1ccccccc1\": 4, \"cnc2c1cn\": 1, \"34c\": 11, \"sc1ccc\": 8, \"ncccn1cccc1\": 2, \"bi\": 9, \"onc\": 14, \"ccccsc1ccc\": 5, \"ccccccnccss\": 2, \"ccccccccccccc\": 10, \"1cl\": 4, \"cncccc12cc3cc\": 3, \"c2c1ccccc1\": 3, \"n2nc\": 2, \"c1ccnnc1\": 2, \"oc1ccccc1o\": 2, \"cccc5\": 2, \"ccn2c1ncccc1n\": 3, \"ccc2c1cccc2\": 6, \"cnc1ccccc1occ\": 2, \"cccccccoc1cccc\": 1, \"clccn1cc2ccc\": 1, \"cccccoc1cccc\": 1, \"1cccc1\": 22, \"cc1ccccc1o\": 6, \"ccc1nc2cnc\": 1, \"nc2nc1cc\": 1, \"coc1ccccc1cl\": 7, \"cc1co1\": 4, \"ccc1c2cc\": 3, \"occc2ccccc2\": 3, \"conc2\": 3, \"coc1ccccc1occ\": 3, \"cc1ccn\": 10, \"cc12ccc3c4\": 2, \"ccc3c1ccc2\": 1, \"4o\": 17, \"2c1\": 11, \"nccssc1cc\": 1, \"ccc1c1ccc\": 1, \"cc1s\": 6, \"nc1cccc2c1cccc2\": 4, \"cccccccc1cccc1\": 1, \"ccnc1ccccc1c\": 3, \"ccccccccccncc\": 1, \"cc1ccncc1\": 6, \"ccc1oc2c\": 4, \"c2ncccn2\": 1, \"ccoc1ccccc1c\": 15, \"cncc1ccc\": 19, \"coc1ccccc1cncc1ccc\": 1, \"cncc1ccccc1oc\": 1, \"cccccccccccccccccccc\": 4, \"c1ncn\": 4, \"nnc1ccccc1\": 5, \"nnc1\": 4, \"cc2cc1c\": 1, \"coc1cc2ccn\": 5, \"3c2cc1oc1cc\": 1, \"1c2c\": 2, \"c2oc1ccc\": 1, \"ccscc1csc\": 1, \"cccccccsccccn1ccsc1\": 1, \"c1sccc1c\": 1, \"cc1cc2ccccc2c2c1c1ccccc1cc2\": 1, \"cccccccccccccccc\": 29, \"sccccccn1cscc1\": 4, \"cn1cncc1\": 7, \"ccc2ccc\": 4, \"sccc\": 5, \"sccc2\": 1, \"cc1cn1\": 1, \"cncl\": 1, \"ccccc1ccss1\": 1, \"clc1ccccc1c2c\": 4, \"nc1n\": 31, \"occ3ccccc3\": 1, \"occ4ccccc4\": 1, \"n1cn2cn\": 1, \"1ccn2c1\": 1, \"c1cc2ccccc2cc1o\": 3, \"occocc\": 8, \"nc1nc\": 31, \"csc1sc2ccccc2n1\": 2, \"c1coc2c\": 7, \"cc1ccsc1br\": 1, \"1cc3c\": 1, \"ccc3n\": 1, \"ccccncccc\": 2, \"oc2cc\": 18, \"oc4cc\": 2, \"cn2c\": 7, \"ncc1ccccn1\": 1, \"occcnccssccncccoc1ccc\": 2, \"c3cccc4c\": 3, \"c1ccc2ccccc2c1\": 10, \"cccn1c2ccccc2sc2c1nccc2\": 1, \"nc1scc\": 6, \"sccccoc1ccccc1\": 2, \"n2cc2\": 14, \"ccnc1\": 8, \"n1c1ccc\": 3, \"sc2cccc\": 2, \"occcccnccssccncccccoc1ccc\": 2, \"1oc1c4c\": 10, \"2ncc3\": 1, \"oc2ccccc2c\": 4, \"occcoc\": 8, \"sccccn1cscc1\": 4, \"c2sc3ccccc3n2\": 1, \"n1c2\": 2, \"nn1ccocc1\": 2, \"ccccoc1ccccc1\": 2, \"c1ccccc1o2\": 1, \"brc1ccc2c\": 14, \"1cc1ccccc1\": 2, \"c2cccnc12\": 5, \"ob\": 9, \"cc1cn2ccc1cc2c\": 3, \"clc1ccccc1c2cc\": 3, \"c2ccoc3\": 1, \"nc2cc2\": 3, \"occ1ob\": 1, \"occ2ob\": 1, \"oc2c\": 23, \"cc1f\": 8, \"cc1cc2c3ccccc3ccc2c4ccccc14\": 1, \"c1ccccc1cc\": 4, \"1occ\": 1, \"csc1nnnn1c\": 1, \"nc1ccccc1ccc1ccccn1c\": 2, \"c2ccccc2o\": 6, \"2occ\": 10, \"2n1c1ccccc1\": 8, \"12ccn\": 8, \"1c4\": 8, \"o1c\": 5, \"ccoccoccocco\": 1, \"12cn3ccc4c\": 1, \"2o1\": 8, \"32ccn2\": 2, \"c1c4cccc1\": 1, \"oc2oc3cc\": 3, \"ccc3n2\": 9, \"c23cc4\": 1, \"c4n2c\": 1, \"ss3\": 2, \"ccsscc\": 7, \"2cc1\": 3, \"ccoccn\": 3, \"coc2cccccc2\": 1, \"c1cc1c\": 3, \"ncn1cccc1\": 2, \"o1ccoccoccocc1\": 1, \"nc6nc\": 3, \"nc7ccccc7\": 6, \"nc8ccccc8\": 1, \"n6\": 5, \"nc1ccccc1o\": 4, \"ccocn\": 1, \"n1cccc1\": 25, \"nc4nc\": 8, \"nc5cc\": 7, \"ccc5\": 3, \"n4\": 12, \"nc6cc\": 6, \"ccc6\": 4, \"cn1c2ccc1cc\": 12, \"c2c3ccc4\": 1, \"c3ccc2\": 3, \"ncc1\": 21, \"c1ccccc1c2cc\": 1, \"cccccccccnccss\": 1, \"cn1n\": 23, \"occo1\": 4, \"c2c1ccc\": 10, \"12cn\": 3, \"c1nnc\": 5, \"nc1ncc\": 8, \"c1oc1coc2ccccc2\": 1, \"oc2ccc1oc\": 1, \"n1ncnc1\": 2, \"nnn2\": 1, \"c2ccc3ccccc3c2\": 2, \"cccnc1\": 3, \"clc1cc2nc\": 7, \"nc1ccn\": 6, \"oc1oc\": 3, \"cnc1ccccc1c\": 5, \"c2nccnc2c1cl\": 1, \"ccn1cccc1\": 15, \"c2c3ccsc3ccc3c2cccc3\": 1, \"occccccccccnccssccnccccccccccoc1ccc\": 1, \"ccccccccccccccccccc1cc\": 1, \"ccnccnccnccn2c\": 1, \"ccoc1c\": 14, \"clc1sc2ccccc2n1\": 1, \"cc1ccc2nc\": 3, \"oc1ccc2ccccc2c1n\": 3, \"nc5ccc6cc\": 1, \"c6c5\": 2, \"cc2nc2c1nc\": 5, \"cocn1ccc\": 1, \"occ1cc2ccn1cc2\": 1, \"brc1ccccc1\": 3, \"ccc1ccncc1\": 3, \"c3ccccc3cl\": 4, \"n2ccc2\": 1, \"oc2c1cc\": 17, \"c1nc2ccccc2c\": 2, \"occnc1nc\": 5, \"nc2cccc\": 10, \"oc1cccc2c1cccc2\": 3, \"nc1ccc2nc\": 2, \"nc1ncn\": 2, \"ccc2n\": 6, \"c2scc3\": 1, \"cococ\": 3, \"c1ccccc1n\": 14, \"cc1i\": 3, \"cccccccccnc\": 2, \"ccnc1cccc2ccccc12\": 1, \"c1n2c3cccc4cccc\": 1, \"c2c5ccccc15\": 1, \"cncccc12ccc\": 2, \"c3c1cccc3\": 4, \"cccccccccccn\": 1, \"c1nc2ccccc2o1\": 1, \"c1oc1cn\": 1, \"cc2co2\": 3, \"cc4ccc\": 2, \"cc5co5\": 1, \"cc6co6\": 1, \"cssc\": 13, \"cc1coc2ccccc2n1c\": 1, \"ccccccccccccccccccc\": 1, \"oc3ccccc3c2\": 2, \"cnc1cnn\": 1, \"1oc2ccccc2c3ccccc13\": 1, \"cn1cccc1c1c\": 10, \"sccf\": 1, \"ccoc1ccccc1n1ccn\": 1, \"cc1cn\": 11, \"ccccccscccccn1ccsc1\": 1, \"c1nccoccoccnccoccoc1\": 1, \"nc1c2cc\": 4, \"ccc2nc2c1cccc2\": 2, \"ccccc1scc2nc\": 1, \"cc1cccc2c3cc4ccccc4cc3cc\": 1, \"c1cccccccccccn1\": 1, \"nccn1\": 20, \"1cc1c3c\": 7, \"ccoc1cc1\": 1, \"ccn1c2ccccc2\": 1, \"ccccccccocco\": 2, \"ccccccccccccccccccoc\": 5, \"c2ccccc12\": 18, \"clc1ccc2oc3cc\": 1, \"ccc3oc2c1\": 1, \"c1cc2cccc3c\": 1, \"o1ccoccoccoccoccocc1\": 1, \"n2cncn2\": 7, \"cnc1cn\": 4, \"fc1ccccc1\": 2, \"nccc1cc\": 5, \"occ1cnc\": 3, \"nccs2\": 1, \"ccccn1cccc\": 4, \"cn1ccn2c\": 6, \"c1ccccc1cc1c2cccc1\": 1, \"coc1cccc2ccccc12\": 2, \"cco1\": 11, \"cccc2c\": 9, \"cccci\": 2, \"cc3c12cl\": 1, \"ccn1c2ccccc2sc2c1cccc2\": 5, \"oc1coc\": 2, \"c1cccc2cc\": 2, \"c1nc2ccccc2nc1\": 1, \"ccccccccccccccccn\": 3, \"ccccccccncccn\": 2, \"c2ccccc2i\": 1, \"c2ccccc2scc2c1cccc2\": 2, \"cccccccccc1ccc\": 3, \"o1c2ccccc2oc3ccccc13\": 1, \"cncc1\": 7, \"cnccsp\": 4, \"cc1sc2cc\": 2, \"c14\": 10, \"c1cccccccccc\": 2, \"fccn\": 7, \"c1oc1\": 3, \"ccccoc1nc\": 8, \"cnccc\": 9, \"cncc1ccco1\": 2, \"cccn1c2ccccc2ncc2c1cc\": 1, \"c1ccccc1sc1ccccc1\": 1, \"ccc1c2c\": 3, \"nc1ncc2ncn\": 1, \"c2n1\": 4, \"nc5ccccc5\": 10, \"nc1nccs1\": 6, \"zr\": 11, \"ccococ1ccccccccccc1\": 1, \"ccocc2\": 10, \"cccccbr\": 2, \"ccc2cc\": 9, \"cc2cc\": 24, \"cc5ccccc5\": 1, \"cc6ccccc6c7ccccc7\": 1, \"cc8cccc9ccccc89\": 1, \"10ccccc\": 5, \"11ccc\": 3, \"12ccccc\": 2, \"13ccccc\": 2, \"13\": 8, \"14ccccc\": 1, \"15ccccc\": 1, \"16ccc\": 1, \"16\": 1, \"17ccccc\": 1, \"17\": 1, \"c1nc2\": 20, \"cc1cccc2c1nc1ccccc1c2\": 1, \"cn1c2ccccc2sc3ccccc13\": 2, \"nc2scnn2\": 1, \"c1cnc2n\": 6, \"1ccc2c3\": 5, \"1cc1ccc\": 4, \"c1c3ccc2\": 4, \"c2ccc1\": 11, \"c2co\": 4, \"coc3\": 6, \"c5ococ5cc24\": 2, \"ccn1c2ccccc2n\": 6, \"cc1ccccn1cccoc\": 11, \"cn1ccnc1\": 5, \"cc2oc2\": 1, \"n1cc1oc1\": 1, \"cc1oc1\": 1, \"ccoc1ccc2c\": 13, \"ccc3cc4c\": 1, \"ccc5ccccc45\": 2, \"occcccc\": 12, \"12ob\": 1, \"coccoccoccoc\": 1, \"ccc1cccnc1\": 3, \"ccncc1ccc\": 2, \"occcc1ccccc1\": 6, \"c2ccccc2cl\": 19, \"clc2ccc\": 1, \"clc3c\": 1, \"cc1csc\": 3, \"oc1c2cc\": 1, \"c2c2\": 2, \"c31oc3c\": 1, \"c12co1\": 1, \"occc1ccccc1\": 7, \"c2c3ccccc3ccc2c4ccccc14\": 1, \"nccn1ccncc1\": 1, \"csc1ccncc1\": 2, \"occn4ccn\": 1, \"cccn2c1ccccc1sc3ccc\": 2, \"n1c2cccc1cn\": 2, \"hf\": 2, \"n1cnc2c1ncnc2cl\": 1, \"n2ccc4ccccn4c\": 1, \"cc3cccc\": 4, \"cc5cccc\": 3, \"ccc2nc\": 2, \"c3ccncc3\": 1, \"cccn2c3ccccc3sc4ccc\": 4, \"occsccccccccccscco\": 1, \"nb\": 6, \"cc1ccccc1oc2cccnn2\": 1, \"ccnccnccsp\": 2, \"occoc1ccccc1\": 5, \"coc1c2c\": 6, \"oc2cc3oc\": 1, \"cc13\": 4, \"cccc2ccccc12\": 1, \"2n\": 23, \"cc1scccs1\": 1, \"coc1ccccc1n\": 4, \"nc2ccc3nc\": 6, \"nc3c2\": 6, \"non2\": 1, \"ccc4c5\": 1, \"c5ccc4\": 2, \"oc6c\": 3, \"o6\": 1, \"oc7c\": 3, \"o7\": 1, \"oc8c\": 2, \"o8\": 1, \"occcl\": 9, \"c1cnc2nc\": 1, \"3c2c\": 2, \"nnc1ccccc1cl\": 1, \"cccs\": 9, \"2cocco\": 3, \"2oc\": 19, \"ccccccccccccccccos\": 1, \"csc1nc\": 5, \"c1ccccc1s\": 7, \"coc1cccc2c1nccc2\": 2, \"cci\": 5, \"pb\": 24, \"c1cc2ccn1cc2c\": 1, \"c1coc\": 2, \"cf\": 7, \"c12ccccc2\": 1, \"occoc1ccccc1c2ccccc2\": 1, \"c1c2ccccc2nc2c1cccc2\": 2, \"clc1ccccc1c1ccccc1cl\": 1, \"oc1cl\": 6, \"ccccoc1c\": 10, \"cccc1o\": 12, \"ccp\": 3, \"ccc1ccc2ococ2c1\": 1, \"ccc4cc5ococ5cc34\": 1, \"ccc3ccc2c3\": 1, \"cc1cncc\": 3, \"ccccccoc1ccccc1c\": 1, \"oc1ccc2ccccc2c1c\": 1, \"ccccoc2cc\": 1, \"c1ccccc1n2\": 1, \"c4ccccc34\": 4, \"c1nccc\": 2, \"ccc1onc\": 3, \"occoc1\": 3, \"c3ccccn3c2\": 1, \"cccn1c2ccccc2ncc2c1cccc2\": 2, \"ccc12ccc3c\": 1, \"occnc1ccccc1\": 3, \"occc1sc\": 2, \"ccocccc\": 1, \"cc7\": 11, \"nc8ccc\": 3, \"cc8\": 6, \"10ccc\": 6, \"13ccc\": 3, \"14ccc\": 1, \"c9\": 4, \"ssc\": 10, \"c3c1cc\": 1, \"cncccn1c2cc\": 1, \"ccc2sc2c1ccc\": 2, \"coccoc\": 9, \"cn3cncn3\": 3, \"nc1cccc2c1nccn2\": 1, \"c1cccc2\": 3, \"cccc12\": 7, \"occcccoc1ccc\": 3, \"42\": 1, \"oc4\": 11, \"brc1\": 13, \"nc2sccn2\": 1, \"cccn1ccn2c\": 2, \"c2ccc1cc\": 1, \"3c2ccc\": 1, \"cnc12cc3cc\": 1, \"c1ccc2c3ccc4cc\": 2, \"ccoc1c2ccccc2ccc2c1cccc2\": 1, \"c1ccc2cc3c4cccc5cccc\": 1, \"c3cc2c1\": 1, \"cccn2\": 4, \"nc2ccc3cc\": 1, \"c4cc5n\": 1, \"c6oc5c\": 1, \"c4n\": 3, \"c2cc3\": 1, \"coccn1c\": 1, \"cnc2n\": 7, \"ccn1c2ncccc2n\": 3, \"c2c1nccc2\": 12, \"cob\": 4, \"nc1ccccc1c2ccccc2\": 1, \"nc1sc\": 2, \"c3cccn3c\": 3, \"nn5c1\": 1, \"occoccn1ccccc1\": 2, \"occ1ccc2c3cc\": 2, \"cc3co\": 1, \"ccccncco\": 1, \"c1ccocc1\": 1, \"brc1cc2oc3cc\": 1, \"cc3c2cc1br\": 1, \"c1cc2ccccc2c\": 12, \"cc2cc1c3cccc23\": 1, \"nc1ccc2cc3ccccc3cc2c1\": 1, \"n1ccnc1\": 3, \"cn4ccocc4\": 2, \"cccccccoc1ccc\": 6, \"occn1c2cc\": 1, \"coc1cc2n3c4\": 1, \"c6cn7cc\": 1, \"7c\": 4, \"56\": 2, \"42c5\": 1, \"c5o\": 4, \"brc1cc2c\": 3, \"c6cccc1c6c2c5c34\": 1, \"c1ccoc1c\": 1, \"occ1ccccc1br\": 1, \"cncc1ccc2\": 1, \"scc1nc\": 1, \"cccccccccccccco\": 2, \"be\": 2, \"cc1nnc\": 3, \"n2ccnc2\": 5, \"c1sccs1\": 5, \"nn1c1ccccc1\": 2, \"1c3oc23\": 1, \"c2ccccc2ns1\": 1, \"n2ccccc2\": 8, \"n3cc3\": 4, \"nc2ccccc2oc2c1cc\": 1, \"cc2c1c\": 5, \"oc2ccccc2c3ccccc13\": 1, \"cccccccs\": 1, \"12nc\": 1, \"cccccs\": 3, \"ccccccccccccccccoc\": 5, \"cconc\": 2, \"cccc1coc\": 1, \"sc2c1\": 2, \"c5sc6c\": 1, \"nccc1ccc\": 11, \"ns1\": 1, \"c2cccnc2\": 12, \"occocccn1ccccc1\": 1, \"nnc1ccc\": 8, \"clc1ccccc1cnc1ccc\": 2, \"c2cc2\": 5, \"clc1ccc2\": 2, \"cn1cnc\": 2, \"c1sc1ncnc2c1\": 1, \"c1ccccc1nc1cccc\": 7, \"cc12cc\": 10, \"ccc43c\": 3, \"brc1cc\": 17, \"c1cn2ccc3c\": 2, \"ccccoccoccocccc\": 1, \"brc1ccccc1cncc1ccc\": 1, \"cncc1ccccc1br\": 1, \"cncc1cccc1\": 1, \"4oc5c\": 3, \"occn6ccocc6\": 1, \"c35\": 6, \"occcn2cscc2\": 2, \"fc1cc2occ\": 1, \"c2cc1n3c\": 1, \"cccc4\": 6, \"ccc1sc2c\": 2, \"nc1ncnc2c1cccc2\": 1, \"cn2c1cc1\": 6, \"oc1n\": 4, \"ccc3nc1\": 2, \"scc1ccccc1\": 5, \"3n4c\": 1, \"cc1oc1cc\": 1, \"1n\": 29, \"ccc3c1cc\": 2, \"1c3c2c\": 2, \"cc3ccn1c\": 2, \"icci\": 1, \"cccnc1ccccc1\": 4, \"ccccccc1ccccc1\": 2, \"cccccccc1cccc\": 1, \"occ2co2\": 4, \"cccccccc3cccc\": 1, \"occ4co4\": 5, \"cccccccc5cccc\": 1, \"occ6co6\": 1, \"ncccccn\": 6, \"cccoc1cc\": 3, \"2cn2\": 2, \"1cccc2\": 2, \"cln1c\": 4, \"occcncccos\": 1, \"ccccccccccccccoc\": 5, \"cncc2\": 3, \"oc2ccccc2nc1\": 2, \"nc4ccc5nc\": 5, \"nc5c4\": 5, \"cc1cccs1\": 11, \"cncc1cccs1\": 1, \"clcc1ccccc1\": 2, \"oc1c2ccc\": 2, \"nc3ccc4c\": 3, \"cc4c3\": 3, \"nc6ccccc6\": 13, \"cc1ccc3c4ccc\": 3, \"scsc\": 3, \"ccc2o\": 8, \"c1ccccccccccc\": 1, \"c1ccccn\": 2, \"1cccccccc1\": 1, \"oc2c1\": 10, \"ccccsc1ncnc2c1\": 1, \"sc1c\": 4, \"n2ccn\": 7, \"cc1con2c1nc1ccccc1c2\": 1, \"ncc1n2c\": 3, \"clcccbr\": 2, \"ccccc1nc\": 4, \"n1cc1ccc\": 4, \"c1ccccc1c1\": 1, \"nnn1\": 2, \"c1cccn1cc\": 3, \"cc1cc2\": 2, \"c1cc2cccc3c2c\": 3, \"c1cccc2c1c3ccc2\": 1, \"cccnc1nc\": 6, \"sccsp\": 1, \"cccccsccccccn1cscc1\": 1, \"n1n\": 9, \"oc1c2c\": 2, \"c31c\": 1, \"cn1cncn1\": 10, \"cn1ccc2\": 6, \"oc2cccc\": 8, \"oc3ccccc3c\": 4, \"c1c2ccc\": 7, \"ccc4c3cc\": 1, \"45o\": 4, \"oc6\": 3, \"c2ccccc2n\": 4, \"n1c2ccccc2c\": 2, \"ccsccc\": 3, \"occcccccccccc\": 2, \"cccccco\": 4, \"brc1oc\": 1, \"c2cccc3ccccc23\": 5, \"c4ccccc4o1\": 1, \"oc1cccc2c1cccn2\": 1, \"ccoccoc\": 9, \"clc1ccccc1cncc1cccc\": 1, \"cncc1ccccc1cl\": 4, \"c1occn1ccocc1\": 3, \"coc1ccccc1n1ccn\": 8, \"cccnc1cc\": 2, \"ncc1ccc2\": 1, \"ccoc1nc\": 7, \"fc12c\": 1, \"ccccccci\": 1, \"c1ncccn1\": 11, \"cc1cccc2cc3ccccc3cc12\": 1, \"csc1c\": 8, \"nc1n1ccn\": 6, \"ccccoccoc\": 5, \"c1cccc2c\": 5, \"coc1ccccc1oc\": 5, \"clcbr\": 2, \"cn1ccc2c\": 7, \"cccc2nc\": 7, \"nc1ncccn1\": 3, \"n1ccnc\": 1, \"c2coc\": 4, \"oc2oc\": 4, \"oc21\": 2, \"2nccc\": 1, \"nc1ccscc1\": 2, \"oc1ccccc1cl\": 4, \"cccn1cnc2c1c\": 1, \"coccoc1ccccc1\": 1, \"occcnc\": 2, \"oc1coc3c\": 1, \"coc13\": 1, \"nc5ccc6c\": 4, \"cccc6\": 2, \"ccc1ccccc1br\": 1, \"nn1cccccc1\": 3, \"ce\": 7, \"ccn2cc\": 2, \"2cc2c4cc\": 2, \"cn2ccnn2\": 1, \"cc1ccc2cc3c\": 2, \"ccc4ccccc34\": 3, \"ccs2\": 3, \"p1\": 4, \"occcn1cccl\": 2, \"ccccccccccco\": 2, \"c2ccccn2\": 4, \"ccccccccccoc1\": 2, \"nnc3\": 3, \"c6cccc\": 2, \"nnc7\": 1, \"c8c\": 4, \"n4c\": 4, \"nnc4\": 1, \"occ1ccc\": 14, \"clcl\": 1, \"c1c1\": 4, \"3ccc2\": 2, \"ccc1c2\": 1, \"cc2c1nccc2\": 6, \"occcocccoc\": 1, \"cc1cocc1\": 1, \"cc4cccc\": 1, \"ccc1s\": 2, \"c2onc\": 2, \"c2ccccc2f\": 2, \"fccccsc\": 2, \"c1nccc2\": 2, \"o1ccoccoccoccocc1\": 1, \"cnccc1ccccc1\": 6, \"n3ccocc3\": 5, \"cn1cccc1c1cccnc1\": 2, \"cc1ccccn1cccocc1ccccc1\": 1, \"c1c2ccnc1c\": 3, \"cc1cnnc2c\": 1, \"c2ccccc2occcl\": 1, \"occc2\": 1, \"cc1ccccn1cccccoc\": 1, \"fcccci\": 1, \"cn1c2ccc1\": 1, \"cccccccccc1ccccc1o\": 1, \"occncco\": 5, \"ccn1ccc2\": 1, \"c1cc1c2cc\": 1, \"nccc2cc\": 1, \"c2cc3c\": 2, \"c4c3\": 3, \"c7cccn7c\": 1, \"n6c1\": 1, \"cn1ccncc1\": 1, \"clcccnc\": 2, \"cc12cccc\": 1, \"occccccco\": 1, \"c1c2ccccc2oc2c1cccc2\": 3, \"cc1cc2nc3ccc\": 1, \"cc3sc2cc1n\": 1, \"occco\": 6, \"c12ccc\": 4, \"oo1\": 4, \"coc1cc2c3ccccc3c\": 1, \"c4ccc5c6ccc7c\": 3, \"c8ccccc8c9cc\": 1, \"c1c5c24\": 2, \"c6c79\": 2, \"c1ccc2oc3ccccc3c2c1\": 1, \"c1nccn1cc\": 7, \"ccsc1ccccc1c\": 1, \"sh\": 3, \"oc1br\": 1, \"cccc1ccccc1\": 9, \"cc5cc\": 3, \"coc1ccc2nccc\": 4, \"3cc4ccn3c\": 1, \"ccc2c1c1cccc3c1\": 2, \"ccn1ccnc\": 1, \"clc1ccccc1cncccncc1ccccc1cl\": 1, \"cccccccoccccccc\": 1, \"conc\": 3, \"ncc1cnc\": 1, \"occ2c1\": 1, \"cc4cc\": 7, \"c5ccc6ccccc6c5\": 1, \"c7cc8ccccc8c7\": 1, \"10ccccc9\": 1, \"11ccccc\": 3, \"13c\": 2, \"34ccc\": 5, \"ccc1cc2\": 11, \"cc3cc\": 11, \"nc5c\": 5, \"cc6cc\": 2, \"ccc56\": 1, \"c1ccc2c3ccccc3c4cccc1c24\": 1, \"nc1cscsc1\": 2, \"cc2c1c1ccc\": 1, \"c2ncccc2c\": 3, \"c4ccccc4c3\": 4, \"c1c5ccccc5\": 1, \"cc1cc2ccccc2c\": 2, \"c1cc2cc\": 6, \"occoc2c\": 1, \"ccccccccccc1ccccc1\": 1, \"c1ccccccccccccn1\": 1, \"n4ccocc4\": 1, \"n8ccocc8\": 3, \"c1cccc2c1nc1ccccc1\": 1, \"n1c2ccc\": 3, \"cc2sc2c1ccc\": 1, \"ccc1ccccn1\": 3, \"cc1sc\": 6, \"cc3cc2c4cccc34\": 1, \"nc1o\": 4, \"cc1ccnc2c1ccc3c\": 1, \"ccnc23\": 1, \"n1cc1ccccc1\": 2, \"1c2ccc1\": 1, \"cn1c2nc\": 4, \"cnccc12cc3cc\": 3, \"c2c2ccccc2\": 4, \"coc2\": 7, \"ncc1occc1\": 1, \"ccc1ccccc1o\": 2, \"sccncccccoc1ncc\": 2, \"coc1cc2cnccc2cc1oc\": 1, \"occs2\": 1, \"occcoc1ccccc1c\": 2, \"ccc1cccs1\": 3, \"clcccn1c\": 1, \"nc2ccccc12\": 7, \"ncccn\": 10, \"c3cnccc3c\": 1, \"ccccccccocc\": 1, \"c1sc2ncccc2nc1\": 1, \"oc1cc2ccccc2cc1c\": 3, \"nnc3cc\": 1, \"c5cc\": 9, \"c6cc7ccccc7cc6o\": 1, \"cc5cl\": 2, \"c3cccn4cccc\": 1, \"1ccnc\": 2, \"1coc1ccc2c\": 1, \"cncc1cccc\": 2, \"nccnc1\": 1, \"ccn1cccc\": 16, \"cscc1ccccc1\": 2, \"sccscc\": 3, \"occscc\": 2, \"cc1ccccn1\": 8, \"c1co\": 4, \"5oc1c2\": 2, \"45ccn3c\": 2, \"c2ccccc2occ2c1cccc2\": 3, \"ccc1csc\": 1, \"cncccc1\": 7, \"c1ccc2ccc\": 2, \"ccncc1coc2\": 1, \"cc1ncc\": 9, \"sc1ccccc1c\": 3, \"cnc1cccc2ccccc12\": 1, \"cc1ccc2ococ2c1\": 2, \"cn2c2cc2\": 2, \"ccn1ccc\": 7, \"occs\": 2, \"ccc1c3cccc1\": 2, \"sc2n\": 1, \"occo4\": 1, \"nccccccccnccccccccn\": 1, \"n3cncn3\": 2, \"cccn1ccncc1\": 1, \"nccscc1nc\": 2, \"cccccnc\": 5, \"nnc1ccnc2c1ccc\": 1, \"c1cc2cc1c\": 4, \"ccccccn1cc\": 2, \"nc1ccco1\": 1, \"fc1cccc\": 11, \"oc3ncc\": 1, \"ccccccoc1ccc\": 7, \"brc1ccc2coc\": 1, \"nccccncccsp\": 1, \"c1ccc2c3cc\": 2, \"nc3cc4c\": 2, \"nccs\": 6, \"ccccccccccccccccccn\": 4, \"oc1cncc2cccnc12\": 1, \"c1cccc2ccccc12\": 6, \"occ2coc\": 1, \"cc34c\": 6, \"cc2ccccc12\": 2, \"cnc1c2cccc1\": 1, \"nc1ncco1\": 6, \"cc1cccc2c1cc3ccccc23\": 1, \"coc5cc\": 1, \"cc6cl\": 2, \"nc8cc\": 2, \"cc8oc\": 1, \"cc9cl\": 2, \"nc2ccccc2cl\": 2, \"c1scccs1\": 1, \"cc2c3ccc\": 1, \"c1c2c\": 7, \"c4o\": 4, \"occccccc\": 4, \"cn3\": 3, \"nc1ccoc1o\": 2, \"ccccncc\": 6, \"1nc2ccccc2n1\": 1, \"dy\": 3, \"ncccnccss\": 1, \"cc1cnc2c\": 7, \"cccccccc1n\": 1, \"cc1cc2cccc\": 1, \"cc1cccc2c1\": 1, \"cc2c1cccn1cc1ccccc1\": 1, \"ccc1c2ccccc2c2c1cccc2\": 2, \"nccccccnc\": 8, \"ccccccccccoc\": 7, \"occccccccccc\": 5, \"ccccccoc1o\": 1, \"c1oc2ccccc2\": 1, \"nccos\": 1, \"occccccccn1ccsc1\": 1, \"ccc2c1n\": 4, \"4co\": 2, \"6c\": 3, \"c8ccccc8\": 5, \"np\": 3, \"c1ncc2c\": 8, \"nccn2\": 8, \"c1ccccc1nc1ccnc2c1ccc\": 2, \"oc1ccccc1c2ccccc2\": 1, \"1cc1c\": 2, \"ccc3o\": 5, \"cn1ccc23c\": 1, \"cc2c1cc1\": 1, \"c1nc2cnc\": 1, \"nc1cccccc1\": 2, \"nccncc2ccncc2\": 1, \"cn2ccccc2\": 2, \"cc1cn1ccccc1\": 1, \"cccccccccccco\": 7, \"c1c2ccccc2c\": 11, \"cc1ccccc1cncc1ccc\": 1, \"cncc1ccccc1c\": 2, \"nccc2ccc\": 1, \"sccnccccoc1ccc\": 2, \"coc12c\": 1, \"n1cc4nc24\": 1, \"ccoc1cc2n\": 1, \"c4oc5cc\": 1, \"cc5n\": 1, \"c3oc2cc1nc\": 1, \"clc1cnc2c\": 3, \"cn1ccoc\": 4, \"nccc1cccs1\": 1, \"cccccc1cc\": 8, \"onc1\": 4, \"c1c2cc3cc4\": 1, \"cccccccccccnccss\": 1, \"occ1cccc\": 10, \"n2ccco2\": 2, \"nccocc\": 1, \"cncc1ccc2c\": 3, \"ccscc1ccccc1oc\": 2, \"sccnc\": 1, \"c1cc2ccccc2s\": 4, \"oc1ccc2cc\": 1, \"ccn1c2ccccc2sc2c1cc\": 1, \"c13c2\": 1, \"c3o1\": 1, \"nc2sc\": 2, \"clc1ccccc1c1ccccc1\": 1, \"ccc2nc2c1ccc\": 2, \"n1c2cncc1cc2\": 1, \"ccn1cccccc1\": 1, \"ccccccccn\": 11, \"c1nncn2cnncn12\": 1, \"occn1cscc1\": 2, \"c1c1ccc\": 6, \"fc1c\": 4, \"c1ccc2cc\": 4, \"c1nccnc1\": 4, \"c1cscn1\": 3, \"ccccccccccnccss\": 1, \"csc1ccc2c\": 4, \"ccc1ccccn1c\": 3, \"c1cnccn1\": 10, \"c2nsnc2c1cl\": 1, \"cncccn1c2ccccc2ccc3ccccc13\": 1, \"oc1ccc2c3ccc4\": 5, \"cccn1cscc1\": 1, \"oc1ccccc1cncc1ccc\": 1, \"cncc1ccccc1o\": 1, \"42ccn2\": 1, \"c4c2\": 1, \"cc1c2ccccc2nc2c1cccc2\": 1, \"21oc1c\": 2, \"cc1ccccc1nc\": 6, \"cc3ccccc3c\": 8, \"c1ccccc1c1c2cc\": 1, \"cc2oc2c1cc\": 1, \"cc1nccc2c1\": 1, \"cc3c4ccccc24ccn3c\": 1, \"cc1c2ccccc2cc3ccc4ccccc4c13\": 1, \"clc1cccc2oc3ccccc3oc12\": 1, \"clc1ccccc1br\": 2, \"coccoccoc1cc\": 1, \"c3c1n\": 2, \"cccop\": 1, \"n1cccc\": 1, \"ccc2ccccc12\": 3, \"nc2ccccc2cc2c1cccc2\": 1, \"occoccoccoc\": 6, \"cc4cc3\": 2, \"cocn1c\": 1, \"occcn1ccocc1\": 1, \"nn2cccccc2\": 1, \"cc1cc2c3ccc\": 3, \"c2c4\": 3, \"c1cc2ccccc2sc2c1cc\": 4, \"c1oc1coc2ccc3c\": 1, \"cccc3c2\": 1, \"c3ccccc3c4\": 1, \"c2c3\": 4, \"ccccccccccn1ccccc1\": 1, \"ccc3oc\": 1, \"n1cc2ccc\": 10, \"c2ccc1c\": 1, \"cn2ccocc2\": 1, \"cc1snnc1c\": 1, \"c1cc2ccc3c4c2c\": 2, \"c1cccc2c1c4c\": 1, \"sccsc\": 3, \"12ss\": 2, \"1nc4c\": 1, \"56n\": 1, \"3nc3c1cccc3\": 1, \"ss5\": 1, \"ccc2c1c1ccccc1\": 1, \"ccccc1oc\": 1, \"cc1ncc1ccco1\": 1, \"c1cncnc1\": 3, \"cocp\": 1, \"ici\": 2, \"ncc3\": 4, \"c1ncccc1n1c\": 1, \"2coc\": 8, \"ccoccoccoc\": 3, \"cc1cc2cc\": 1, \"ccc2ccccc2\": 4, \"ccn1c2ccccc2c2c1cc\": 1, \"nccc1c\": 10, \"cccc1cccc1\": 1, \"s1c\": 1, \"cc1ccccc1nc1c\": 3, \"ccccoccnc1ccc\": 1, \"cc1onc\": 5, \"ssc1ccc\": 1, \"ccco1\": 3, \"4ccc5\": 2, \"nccccccnc2cc\": 1, \"nc1cs\": 1, \"scn1n\": 3, \"n1cccccc1\": 3, \"c2c1nccn2\": 1, \"occ1ccccc1o\": 3, \"coccoccocco\": 1, \"cccc1coccn1cco\": 1, \"c2ccccc2c3ccccc13\": 3, \"c1nc2ccccc2n1\": 1, \"coc1cccc2c1c1ccccc1n2ccc\": 1, \"coc1cccccc1\": 1, \"nc1c2ccccc2nc2c1cccc2\": 6, \"c2c1cccc2c\": 2, \"c1cc3ccccc3cc1c2\": 1, \"n1cc2\": 5, \"ccccccccc1\": 2, \"cnccn\": 2, \"ccc2oc3ccccc3cl\": 1, \"ccc4cl\": 6, \"ccocococc\": 1, \"ccccccccsc\": 2, \"nnc1c2ccccc2\": 1, \"c3oc4\": 1, \"oc1ccccc1oc\": 4, \"occs1\": 3, \"cc2sc2c1cc\": 3, \"c1c2ccsc2scc2c1cccc2\": 1, \"cc1cscc1\": 4, \"c1ccccc1cnc2\": 1, \"c1ccccccccc1\": 1, \"ccc2c1c\": 6, \"1ccc3c\": 2, \"oco1\": 4, \"c1occ2c\": 1, \"occcccccn1ccsc1\": 3, \"n3c2sc\": 1, \"cc2c3c1occ\": 1, \"n3cc\": 1, \"oc3oc\": 2, \"cc1ccccccc1\": 3, \"occcoc1ccc\": 2, \"c3cccc3\": 1, \"fccccccc\": 1, \"oc1noc\": 1, \"c1c2ccccc2cc2c1cccc2\": 3, \"c5cc6ccccc6c\": 1, \"ccc7c\": 2, \"nc4c\": 6, \"cc5cc4\": 4, \"cc1noc2c1cccc2\": 1, \"nccnccnccnccn\": 3, \"n3ccc\": 2, \"nc1cccc2c1nccc2\": 1, \"cccccccnc1c2ccccc2nc2c1cccc2\": 1, \"c1n2c3ccccc3nc2c4ccc5c6nc7ccccc7n6c\": 1, \"c8ccc1c4c58\": 1, \"ccc2sc2c1cc\": 6, \"cocn1ccn\": 2, \"cc1ccccn1ccccoc\": 1, \"ncccccc\": 7, \"cnccss\": 5, \"cc2c1nc\": 1, \"ccc2cl\": 6, \"cc1coc\": 2, \"c1sccn1c\": 1, \"c2ccoc2\": 2, \"n1c2ccccc2sc2c1cccc2\": 9, \"nc2cnc3ccccc3n2\": 1, \"nc1oc2c\": 6, \"2ccc\": 2, \"3ccc\": 1, \"4ccc\": 1, \"c3sc4c\": 3, \"occoccoccoccoc\": 2, \"cnc1cccc1\": 1, \"c1nc1ncc\": 3, \"cccc1c3ccccc3\": 1, \"c1ccncc1c\": 2, \"c1ccccccccccc1\": 3, \"coc1cccc2c1n\": 2, \"c3c4nc5ccc6c7ccccc7c\": 1, \"c4ccc13\": 1, \"c5c68\": 4, \"c1cc2cccnc2c3ncccc13\": 1, \"c1cc2c3ccc4ccccc4c3cc5cccc1c25\": 1, \"cc1cccc2\": 1, \"cc3cccc4nc\": 1, \"nc5cc6c\": 1, \"cc1cccc2c1nc1ccccc1c2n\": 1, \"ccc1c2cc2cccc3c2c1cc3\": 2, \"ccoc1ccccc1nc\": 3, \"sc1nnc\": 1, \"csc4nnc\": 1, \"cccccccccccccn\": 1, \"occ2oc\": 3, \"sccccccccn1ccsc1\": 2, \"ccoc2ncnc3ccccc23\": 1, \"c2ccccc2c2\": 1, \"nccn12\": 1, \"fcccccccccccl\": 1, \"c1ccccc1nc1c\": 2, \"ccc3nc4c\": 1, \"occoc1c\": 2, \"clccoc1\": 1, \"nnc1c2ccccc2nc2c1cccc2\": 1, \"clc1cccnc1occcnccss\": 1, \"n1cc4co4\": 1, \"o1cc\": 1, \"sc2sc3ccccc3n2\": 2, \"sccnccccccc1ccccc1\": 1, \"coc1ccccc1ncc\": 1, \"c3c4\": 4, \"c4c6\": 1, \"c6c3\": 1, \"cc4oc\": 3, \"ccn1c2nc\": 2, \"c1ccc2n\": 4, \"ch2\": 11, \"coc1ccc2cc5c3c\": 1, \"c4oc1c2c34ccn5c\": 1, \"occ1co1\": 7, \"occ3co3\": 3, \"cnc2cccnc12\": 1, \"cc1ccc2cc\": 2, \"coc1cc2ccc\": 1, \"oc2cc1o\": 1, \"cncc1ccccc1\": 7, \"ccccl\": 5, \"1nc2cc\": 2, \"ccn1cnc2n\": 1, \"cc1ccsc1cl\": 1, \"c1occo\": 1, \"c2cc3ccccc3cc2o\": 8, \"clc1ccccc1i\": 2, \"c1sccc1\": 3, \"cc1cc2ccccc2cc1c\": 1, \"cc1nc2cc\": 3, \"cc1ccccc1c\": 12, \"occ1ccncc1\": 2, \"ooc1\": 3, \"clcc2co2\": 1, \"c3oc4ccc\": 3, \"cc4n3\": 3, \"ccc1cccc2c\": 1, \"cc1cco1\": 1, \"1c1\": 6, \"cccoc1ccc2c\": 2, \"c1ncc2\": 2, \"clc1ccccc1cncc1ccccc1\": 1, \"ccc4oc5ccccc5\": 1, \"ph\": 7, \"cocc1co1\": 1, \"nc1nccnc1c\": 1, \"occccccccccoc\": 2, \"clc1cnc\": 9, \"c2occ3\": 1, \"occcoc1cc\": 1, \"sccncccccc1ccccc1\": 1, \"c3oc4cc\": 1, \"ccc4oc\": 3, \"c1ccc2nccnc2c1\": 1, \"c1ccccc1cccc1c2cccc1\": 1, \"cocccn\": 1, \"nncc1ccccc1\": 8, \"ccc3cc\": 5, \"1c1ccccc1\": 5, \"scccccccn1ccsc1\": 4, \"ncccccf\": 1, \"cah2\": 1, \"c3cn4ccc3c\": 1, \"oc1cc2ccccc2cc1c3\": 1, \"nccn3\": 1, \"nn4ccncc4\": 1, \"ic1ccc2c\": 2, \"cc1ccc2c3ccc\": 1, \"c1ccc2cc3ccccc3cc2c1\": 2, \"ccc1occ1c2cccc1\": 2, \"occccco\": 1, \"occ1cn2ccn1cc2\": 1, \"oc2ccccc2cl\": 3, \"oc1cnc\": 2, \"c1occn1\": 2, \"oc3c2cccc3\": 1, \"ccccccscccn1cscc1\": 1, \"cococ1\": 4, \"ccccnc1ccccc1c\": 1, \"oc1ccccccc1\": 2, \"1ccccccc\": 1, \"ccccocc1ccc\": 1, \"c2cc3n1ccc31c3\": 1, \"n3c\": 7, \"cc2c31\": 1, \"cc2c3cc\": 1, \"coccnc1nc2nc\": 1, 